* Rahil Sayyad
* Email id: rahilsayyad389@gmail.com

In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={"A1":[2,3,4,5],"A2":[22,44,33,22],"A3":["M","N","O","P"]} # create a dictinary

In [3]:
dict1

{'A1': [2, 3, 4, 5], 'A2': [22, 44, 33, 22], 'A3': ['M', 'N', 'O', 'P']}

In [5]:
ab=pd.DataFrame(dict1)# create a DataFrame

In [6]:
ab

   A1  A2 A3
0   2  22  M
1   3  44  N
2   4  33  O
3   5  22  P

# info or unique

In [8]:
ab["A1"].unique() # find unique value

array([2, 3, 4, 5], dtype=int64)

In [9]:
ab["A2"].unique()

array([22, 44, 33], dtype=int64)

In [10]:
ab["A2"].nunique() # find no of unique value

3

In [16]:
ab["A2"].value_counts() # count values

22    2
44    1
33    1
Name: A2, dtype: int64

In [17]:
ab["no"]=ab["A1"]+ab["A2"] # add new column

In [18]:
ab

   A1  A2 A3  no
0   2  22  M  24
1   3  44  N  47
2   4  33  O  37
3   5  22  P  27

In [21]:
newab = ab[(ab['A1']>2) & (ab['A2']>22)] #selection

In [22]:
newab

   A1  A2 A3  no
1   3  44  N  47
2   4  33  O  37

In [23]:
def rahil(a):
    return a*5

In [25]:
rahil(ab)

   A1   A2     A3   no
0  10  110  MMMMM  120
1  15  220  NNNNN  235
2  20  165  OOOOO  185
3  25  110  PPPPP  135

In [26]:
ab

   A1  A2 A3  no
0   2  22  M  24
1   3  44  N  47
2   4  33  O  37
3   5  22  P  27

In [28]:
ab['A1'].apply(rahil)

0    10
1    15
2    20
3    25
Name: A1, dtype: int64

In [29]:
ab["A2"].sum() # find sum of col A2

121

In [31]:
ab["A2"].max() # find max value of col A2

44

In [32]:
del ab["no"]

In [33]:
ab

   A1  A2 A3
0   2  22  M
1   3  44  N
2   4  33  O
3   5  22  P

In [36]:
ab.index # check index

RangeIndex(start=0, stop=4, step=1)

In [38]:
ab.columns # check column

Index(['A1', 'A2', 'A3'], dtype='object')

In [41]:
ab.sort_values(["A2"]) # sort value accending order

   A1  A2 A3
0   2  22  M
3   5  22  P
2   4  33  O
1   3  44  N

In [42]:
ab.isnull() # find null value

      A1     A2     A3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [43]:
ab.notnull() # find not null value

     A1    A2    A3
0  True  True  True
1  True  True  True
2  True  True  True
3  True  True  True

In [44]:
ab.dropna() # drop null value

   A1  A2 A3
0   2  22  M
1   3  44  N
2   4  33  O
3   5  22  P

In [49]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi',np.nan]})

In [50]:
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  NaN

In [51]:
df.dropna() # drop null value

   col1   col2 col3
1   2.0  555.0  def
2   3.0  666.0  ghi

In [52]:
df

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  NaN

In [53]:
df.fillna("rahil") # fill null value

    col1   col2   col3
0    1.0  rahil    abc
1    2.0  555.0    def
2    3.0  666.0    ghi
3  rahil  444.0  rahil